#Напишите программу, которая будет преобразовывать десятичное число в двоичное.

num = int(input("Вветиде число: "))
print(bin(num))